dump/file1.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <SOAP-ENV:Header>
      <cwmp:ID SOAP-ENV:mustUnderstand="1">629695424</cwmp:ID>
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <cwmp:Inform>
         <DeviceId>
            <Manufacturer>Broadcom</Manufacturer>
            <OUI>a06518</OUI>
            <ProductClass>968380GERG</ProductClass>
            <SerialNumber>a0651806d37f</SerialNumber>
         </DeviceId>
         <Event SOAP-ENC:arrayType="cwmp:EventStruct[1]">
            <EventStruct>
               <EventCode>6 CONNECTION REQUEST</EventCode>
               <CommandKey />
            </EventStruct>
         </Event>
         <MaxEnvelopes>1</MaxEnvelopes>
         <CurrentTime>1970-01-04T18:05:55+00:00</CurrentTime>
         <RetryCount>0</RetryCount>
         <ParameterList SOAP-ENC:arrayType="cwmp:ParameterValueStruct[0008]">
            <ParameterValueStruct>
               <Name>InternetGatewayDevice.DeviceSummary</Name>
               <Value xsi:type="xsd:string">InternetGatewayDevice:1.5[](Baseline:1, EthernetLAN:1, USBLAN:1, Time:1, IPPing:1, DeviceAssociation:1, QoS:1, WiFiLAN:1)</Value>
            </ParameterValueStruct>
            <ParameterValueStruct>
               <Name>InternetGatewayDevice.DeviceInfo.SpecVersion</Name>
               <Value xsi:type="xsd:string">1.0</Value>
            </ParameterValueStruct>
            <ParameterValueStruct>
               <Name>InternetGatewayDevice.DeviceInfo.HardwareVersion</Name>
               <Value xsi:type="xsd:string">tmp_hardware1.0</Value>
            </ParameterValueStruct>
            <ParameterValueStruct>
               <Name>InternetGatewayDevice.DeviceInfo.SoftwareVersion</Name>
               <Value xsi:type="xsd:string">G4.16L.06RC1</Value>
            </ParameterValueStruct>
            <ParameterValueStruct>
               <Name>InternetGatewayDevice.DeviceInfo.ProvisioningCode</Name>
               <Value xsi:type="xsd:string" />
            </ParameterValueStruct>
            <ParameterValueStruct>
               <Name>InternetGatewayDevice.ManagementServer.ConnectionRequestURL</Name>
               <Value xsi:type="xsd:string">http://10.84.3.122:30005/</Value>
            </ParameterValueStruct>
            <ParameterValueStruct>
               <Name>InternetGatewayDevice.ManagementServer.ParameterKey</Name>
               <Value xsi:type="xsd:string">unsetCommandKey</Value>
            </ParameterValueStruct>
            <ParameterValueStruct>
               <Name>InternetGatewayDevice.WANDevice.5.WANConnectionDevice.1.WANIPConnection.1.ExternalIPAddress</Name>
               <Value xsi:type="xsd:string">10.84.3.122</Value>
            </ParameterValueStruct>
         </ParameterList>
      </cwmp:Inform>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>